In [2]:
%%capture
%load_ext sql
%sql sqlite:///Jobs.db

In [6]:
%%sql

SELECT Major, MIN(Unemployment_rate) AS min_rate
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[('MATHEMATICS AND COMPUTER SCIENCE', 0.0)]

In [5]:
%%sql

SELECT Major, MIN(ShareWomen) AS min_women
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[('MISCELLANEOUS ENGINEERING TECHNOLOGIES', 0.0)]

In [8]:
%%sql

SELECT Major, MAX(Unemployment_rate) AS max_unemployment_rate
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[('NUCLEAR ENGINEERING', 0.177226407)]

In [9]:
%%sql

SELECT DISTINCT Major_category
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[('Engineering',),
 ('Business',),
 ('Physical Sciences',),
 ('Law & Public Policy',),
 ('Computers & Mathematics',),
 ('Agriculture & Natural Resources',),
 ('Industrial Arts & Consumer Services',),
 ('Arts',),
 ('Health',),
 ('Social Science',),
 ('Biology & Life Science',),
 ('Education',),
 ('Humanities & Liberal Arts',),
 ('Psychology & Social Work',),
 ('Communications & Journalism',),
 ('Interdisciplinary',)]

In [10]:
%%sql
SELECT Major_category, SUM(Unemployed) AS total_unemployed
FROM recent_grads
WHERE Major_category = "Engineering"

 * sqlite:///Jobs.db
Done.

[('Engineering', 29817)]

In [11]:
%%sql

SELECT COUNT(Major) AS total_majors
FROM recent_grads
WHERE Major_category = "Engineering";

 * sqlite:///Jobs.db
Done.

[(29,)]

In [14]:
%%sql

SELECT ROUND(AVG(Unemployment_rate) * 100, 2) AS Mean_rate
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[(6.86,)]

In [16]:
%%sql
SELECT ROUND(Sharewomen, 2) AS Sharewomen_rounded
FROM recent_grads
LIMIT 10;

 * sqlite:///Jobs.db
Done.

[(0.12,),
 (0.1,),
 (0.15,),
 (0.11,),
 (0.34,),
 (0.14,),
 (0.54,),
 (0.44,),
 (0.14,),
 (0.44,)]

In [20]:
%%sql
SELECT 
    ROUND(AVG(Unemployment_rate), 2) AS Average, 
    ROUND(MIN(Unemployment_rate), 2) AS Minimum, 
    ROUND(MAX(Unemployment_rate), 2) AS Maximum
FROM recent_grads;

 * sqlite:///Jobs.db
Done.

[(0.07, 0.0, 0.18)]

In [22]:
%%sql
SELECT Major
FROM recent_grads
WHERE Unemployment_rate IS NULL;

 * sqlite:///Jobs.db
Done.

[('MILITARY TECHNOLOGIES',)]

In [25]:
%%sql
SELECT Sharewomen, Sharewomen * 100 AS percent_female
FROM recent_grads
LIMIT 10;

 * sqlite:///Jobs.db
Done.

[(0.120564344, 12.0564344),
 (0.10185185199999999, 10.1851852),
 (0.153037383, 15.3037383),
 (0.107313196, 10.731319599999999),
 (0.341630502, 34.1630502),
 (0.144966965, 14.4966965),
 (0.535714286, 53.571428600000004),
 (0.44135557299999995, 44.135557299999995),
 (0.139792801, 13.979280099999999),
 (0.437846874, 43.7846874)]

In [27]:
%%sql
SELECT Total, Men + Women AS sum_men_women
FROM recent_grads
LIMIT 10;

 * sqlite:///Jobs.db
Done.

[(2339, 2339),
 (756, 756),
 (856, 856),
 (1258, 1258),
 (32260, 32260),
 (2573, 2573),
 (3777, 1792),
 (1792, 3777),
 (91227, 15058),
 (81527, 14955)]